/* 
  FNProduct.strings
  FNLicensing

  Created by Marc Beyerlin on 06.11.13.
  Copyright (c) 2013 Fournova GmbH. All rights reserved.
*/

"SERVER_ERROR_DESCRIPTION" = "Registration Failed";
"SERVER_ERROR_FAILURE_REASON" = "Did not receive a well-formed response from the server.";
"SERVER_ERROR_RECOVERY_SUGGESTION" = "Sorry, but the trial registration server could not be contacted. Please try again later.";

"INVALID_TRIAL_REGISTRATION_INFO_DESCRIPTION" = "Trial Registration Failed";
"INVALID_TRIAL_REGISTRATION_INFO_FAILURE_REASON" = "The trial registration info is invalid.";
"INVALID_TRIAL_REGISTRATION_INFO_SUGGESTION" = "Please try again later or contact us at info@fournova.com";

"TRIAL_NOT_EXPANDABLE_DESCRIPTION" = "Can not expand the Trial.";
"TRIAL_NOT_EXPANDABLE_FAILURE_REASON" = "The Trial period is expired.";
"TRIAL_NOT_EXPANDABLE_SUGGESTION" = "Buy a license or contact us at info@fournova.com";

"INVALID_BETA_REGISTRATION_INFO_DESCRIPTION" = "Beta Registration Failed";
"INVALID_BETA_REGISTRATION_INFO_FAILURE_REASON" = "The beta registration info is invalid.";
"INVALID_BETA_REGISTRATION_INFO_SUGGESTION" = "Please try again later or contact us at info@fournova.com";

"INVALID_LICENSE_ACTIVATION_INFO_DESCRIPTION" = "License Activation Failed";
"INVALID_LICENSE_ACTIVATION_INFO_FAILURE_REASON" = "The activation code is invalid.";

"INVALID_LICENSE_NAME_ACTIVATION_INFO_DESCRIPTION" = "License Activation Failed";
"INVALID_LICENSE_NAME_ACTIVATION_INFO_FAILURE_REASON" = "The license name is invalid.";

"INVALID_LICENSE_ACTIVATION_INFO_SUGGESTION" = "Please make sure to enter both license key AND license name exactly as they appear in your order email. Copy pasting the information is the easiest way to enter it.";

"ACTIVATION_LIMIT_REACHED_ERROR_DESCRIPTION" = "Registration Failed";
"ACTIVATION_LIMIT_REACHED_ERROR_FAILURE_REASON" = "The registration server responded with ACTIVATION_LIMIT_REACHED_ERROR error code.";
"ACTIVATION_LIMIT_REACHED_ERROR_RECOVERY_SUGGESTION" = "Tower cannot be activated. The activation limit for your license key has been reached.\n\nIf you are switching machines, please deactivate Tower first on the old machine before installing it on your new one. That way your activation limit won't be affected. You can deactivate Tower via the menu (“Tower” --> “Registration...” --> “Deactivate on This Machine”).\n\nIn case of further questions please contact our support.";

"DEACTIVATION_FAILED_ERROR_DESCRIPTION" = "Deactivation failed";
"DEACTIVATION_FAILED_ERROR_FAILURE_REASON" = "The registration server responded with FAILED_TO_REVOKE_ACTIVATION_ERROR error code.";
"DEACTIVATION_FAILED_ERROR_RECOVERY_SUGGESTION" = "This license can not be deactivated. Maybe it is already deactivated.";
